cfe llm/InformationRegisters/AI_ЖурналЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ЖурналЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусHTTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходныеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходныеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТулТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйПромт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_Диалоги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификатоБеседыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_РольСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБеседы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/CommonModules/AI_ОбслуживаниеСервер/Ext/Module.bsl
Процедура ОчиститьУстаревшие() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	СрокЛогов    = Константы.AI_СрокХраненияЖурналаЗапросовДней.Получить();
	СрокДиалогов = Константы.AI_СрокХраненияДиалоговДней.Получить();

	УдаленоЛогов    = ОчиститьЖурналЗапросов(СрокЛогов);
	УдаленоДиалогов = ОчиститьДиалоги(СрокДиалогов);

	ЗаписьЖурналаРегистрации(
		"AI_Обслуживание",
		УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон(
			"Очистка: удалено %1 записей AI_ЖурналЗапросов (срок %2 дн.), %3 записей AI_Диалоги (срок %4 дн.)",
			УдаленоЛогов, СрокЛогов, УдаленоДиалогов, СрокДиалогов));

КонецПроцедуры

Функция ОчиститьЖурналЗапросов(СрокДней) Экспорт

	Если СрокДней <= 0 Тогда
		Возврат 0;
	КонецЕсли;

	Граница = НачалоДня(ТекущаяДатаСеанса() - СрокДней * 86400);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_ЖурналЗапросов.Период          КАК Период,
		|	AI_ЖурналЗапросов.Пользователь    КАК Пользователь,
		|	AI_ЖурналЗапросов.Провайдер       КАК Провайдер,
		|	AI_ЖурналЗапросов.Модель          КАК Модель,
		|	AI_ЖурналЗапросов.СистемныйПромт  КАК СистемныйПромт
		|ИЗ
		|	РегистрСведений.AI_ЖурналЗапросов КАК AI_ЖурналЗапросов
		|ГДЕ
		|	AI_ЖурналЗапросов.Период < &Граница";
	Запрос.УстановитьПараметр("Граница", Граница);

	Выборка = Запрос.Выполнить().Выбрать();
	Удалено           = 0;
	ВПачке            = 0;
	РазмерПачки       = 200;
	ТранзакцияОткрыта = Ложь;

	Попытка
		Пока Выборка.Следующий() Цикл

			Если НЕ ТранзакцияОткрыта Тогда
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				ВПачке = 0;
			КонецЕсли;

			Запись = РегистрыСведений.AI_ЖурналЗапросов.СоздатьМенеджерЗаписи();
			Запись.Период         = Выборка.Период;
			Запись.Пользователь   = Выборка.Пользователь;
			Запись.Провайдер      = Выборка.Провайдер;
			Запись.Модель         = Выборка.Модель;
			Запись.СистемныйПромт = Выборка.СистемныйПромт;
			Запись.Удалить();

			Удалено = Удалено + 1;
			ВПачке  = ВПачке + 1;

			Если ВПачке >= РазмерПачки Тогда
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
			КонецЕсли;

		КонецЦикла;

		Если ТранзакцияОткрыта Тогда
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
		КонецЕсли;

	Исключение
		Если ТранзакцияОткрыта Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

	Возврат Удалено;

КонецФункции

Функция ОчиститьДиалоги(СрокДней) Экспорт

	Если СрокДней <= 0 Тогда
		Возврат 0;
	КонецЕсли;

	Граница = НачалоДня(ТекущаяДатаСеанса() - СрокДней * 86400);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_Диалоги.Период                  КАК Период,
		|	AI_Диалоги.ИдентификаторБеседы     КАК ИдентификаторБеседы,
		|	AI_Диалоги.ИдентификаторСообщения  КАК ИдентификаторСообщения
		|ИЗ
		|	РегистрСведений.AI_Диалоги КАК AI_Диалоги
		|ГДЕ
		|	AI_Диалоги.Период < &Граница";
	Запрос.УстановитьПараметр("Граница", Граница);

	Выборка = Запрос.Выполнить().Выбрать();
	Удалено           = 0;
	ВПачке            = 0;
	РазмерПачки       = 200;
	ТранзакцияОткрыта = Ложь;

	Попытка
		Пока Выборка.Следующий() Цикл

			Если НЕ ТранзакцияОткрыта Тогда
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				ВПачке = 0;
			КонецЕсли;

			Запись = РегистрыСведений.AI_Диалоги.СоздатьМенеджерЗаписи();
			Запись.Период                 = Выборка.Период;
			Запись.ИдентификаторБеседы    = Выборка.ИдентификаторБеседы;
			Запись.ИдентификаторСообщения = Выборка.ИдентификаторСообщения;
			Запись.Удалить();

			Удалено = Удалено + 1;
			ВПачке  = ВПачке + 1;

			Если ВПачке >= РазмерПачки Тогда
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
			КонецЕсли;

		КонецЦикла;

		Если ТранзакцияОткрыта Тогда
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
		КонецЕсли;

	Исключение
		Если ТранзакцияОткрыта Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

	Возврат Удалено;

КонецФункции
